#language: ru

@tree

Функционал: Проверка документа Расход товара

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Проверка документа
*Создание документа
	И В командном интерфейсе я выбираю "Продажи" "Документы продаж"
	Тогда открылось окно "Документы продаж"
	И я нажимаю на кнопку с именем 'ФормаСоздатьПоПараметруРасходТовара'
	Тогда открылось окно "Продажа товара (создание)"
	И из выпадающего списка с именем 'Организация' я выбираю точное значение "ООО \"1000 мелочей\""
	И из выпадающего списка с именем 'Покупатель' я выбираю точное значение "Корнет ЗАО"
	И из выпадающего списка с именем 'Склад' я выбираю точное значение "Склад отдела продаж"
*Заполнение таблицы товары
	И в таблице 'Товары' я нажимаю на кнопку с именем 'ТоварыДобавить'
	И в таблице 'Товары' я нажимаю кнопку выбора у реквизита с именем 'ТоварыТовар'
	Тогда открылось окно "Товары"

	И я нажимаю на кнопку с именем 'ФормаСписок'
	
	
	И в таблице 'Список' я перехожу к строке:
		| "Артикул" | "Код"       | "Количество" | "Наименование" |
		| "Т78"     | "000000032" | "*"     | "Торт "        |
	И я нажимаю на кнопку с именем 'ФормаВыбрать'
	Тогда открылось окно "Продажа товара (создание) *"
	И в таблице 'Товары' я активизирую поле с именем 'ТоварыЦена'
	И в таблице 'Товары' в поле с именем 'ТоварыЦена' я ввожу текст "100,00"
	И в таблице 'Товары' я активизирую поле с именем 'ТоварыКоличество'
	И в таблице 'Товары' в поле с именем 'ТоварыКоличество' я ввожу текст "2,00"
	И в таблице 'Товары' я завершаю редактирование строки
	И в таблице 'Товары' я нажимаю на кнопку с именем 'ТоварыДобавить'
	И в таблице 'Товары' я нажимаю кнопку выбора у реквизита с именем 'ТоварыТовар'
	Тогда открылось окно "Товары"
	Когда открылось окно "Товары"
	И в таблице 'Список' я перехожу к строке:
		| "Код"       | "Наименование" |
		| "000000037" | "Доставка"     |
	И в таблице 'Список' я выбираю текущую строку
	
	Тогда открылось окно "Продажа товара (создание) *"
	И в таблице 'Товары' я активизирую поле с именем 'ТоварыЦена'
	И в таблице 'Товары' в поле с именем 'ТоварыЦена' я ввожу текст "100,00"
	И в таблице 'Товары' я завершаю редактирование строки
	И я нажимаю на кнопку с именем 'ФормаЗаписать'

	И я запоминаю заголовок текущего окна как "$НазваниеРегистратора$"

	И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'

*Проверка печатной формы
	И в таблице 'Список' я выбираю текущую строку
	И я нажимаю на кнопку с именем 'ФормаДокументРасходТовараПечатьРасходнойНакладной'
	Тогда табличный документ 'SpreadsheetDocument' равен:
		| 'Расход товара' | ''                           | ''           | ''      |
		| ''              | ''                           | ''           | ''      |
		| 'Номер'         | '*'                  | ''           | ''      |
		| 'Дата'          | '*'        | ''           | ''      |
		| 'Покупатель'    | 'Корнет ЗАО'                 | ''           | ''      |
		| 'Склад'         | 'Склад отдела продаж'        | ''           | ''      |
		| 'Сумма'         | '300 рублей (Триста рублей)' | ''           | ''      |
		| 'Вес'           | ''                           | ''           | ''      |
		| ''              | ''                           | ''           | ''      |
		| 'Товар'         | 'Цена'                       | 'Количество' | 'Сумма' |
		| 'Торт '         | '100'                        | '2'          | '200'   |
		| 'Доставка'      | '100'                        | '1'          | '100'   |
	
	И Пауза 5
*Проверка регистра продаж
	И В командном интерфейсе я выбираю "Продажи" "Регистр продаж"
	
	Тогда таблица 'Список' содержит строки:
		| 'Период'              | 'Регистратор'                              | 'Номер строки' | 'Покупатель'                | 'Товар'       | 'Количество' | 'Сумма'     |
		| '*' | '$НазваниеРегистратора$' | '2'            | 'Корнет ЗАО'                | 'Доставка'    | '1,00'       | '100,00'    |
		| '*' | '$НазваниеРегистратора$' | '1'            | 'Корнет ЗАО'                | 'Торт '       | '2,00'       | '200,00'    |

*Проверка регистра товарных запасов
	И В командном интерфейсе я выбираю "Продажи" "Регистр товарных запасов"
	Тогда таблица 'Список' содержит строки:
		| "Количество" | "Номер строки" | "Период"              | "Регистратор"                              | "Склад"               | "Товар" |
		| "2,00"       | "1"            | "*" | "$НазваниеРегистратора$" | "Склад отдела продаж" | "Торт " |

*Проверка регистра
	И В командном интерфейсе я выбираю "Финансы" "Регистр взаиморасчетов с контрагентами"
	Когда открылось окно "Регистр взаиморасчетов с контрагентами"
	Тогда таблица 'Список' содержит строки:
		| "Контрагент" | "Номер строки" | "Период"              | "Регистратор"                              | "Сумма"  |
		| "Корнет ЗАО" | "1"            | "*" | "$НазваниеРегистратора$" | "300,00" |
		
				
	






