#language: ru

@tree

Функционал: Проверка формирования отчета Остатки

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Запуск отчета
*Формирование отчета
	И В командном интерфейсе я выбираю "Закупки" "Остатки товаров"
	Тогда открылось окно "Остатки товаров (Остатки товаров с характеристиками)"
	И я нажимаю на кнопку с именем 'ФормаСформировать'
	И Пауза 10
*Проверка отчета
	И в табличном документе "Результат" ячейка с адресом "R2C1" равна "Bosch1234"




