#language: ru

@tree

Функционал: Проверка возможности прикрепить файл картинки в Товар

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Загрузить картинку
*Заполнение Товара
	И В командном интерфейсе я выбираю "Закупки" "Товар"
	Тогда открылось окно "Товар (создание)"
	И в поле с именем 'Наименование' я ввожу текст "тестовый"
	И в поле с именем 'Артикул' я ввожу текст "123"
	И из выпадающего списка с именем 'Поставщик' я выбираю точное значение "Корнет ЗАО"
	И в поле с именем 'ВТ_Вес' я ввожу текст "1,000"
	И в поле с именем 'ШтрихКод' я ввожу текст "123"
	И я нажимаю на кнопку с именем 'ФормаЗаписать'

*Проверка возможностей добавления файла
	И я нажимаю кнопку выбора у поля с именем 'ФайлКартинки'
	Тогда открылось окно "Файлы"
	И я нажимаю на кнопку с именем 'ФормаСоздать'
	Тогда открылось окно "Файл (создание)"
	И в поле с именем 'Наименование' я ввожу текст "Тестовый"
	И я выбираю файл 'C:\Users\Ilya\Pictures\Screenshots\Снимок экрана 2026-10-03 213028.png'
	И я нажимаю на кнопку с именем 'ВыбратьФайлСДискаИЗаписать'
	Тогда открылось окно "Тестовый (Файл)"
	И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
	И я жду закрытия окна "Тестовый (Файл)" в течение 10 секунд
	Тогда открылось окно "Файлы"
	И я нажимаю на кнопку с именем 'ФормаВыбрать'
	Тогда элемент формы с именем 'ФайлКартинки' стал равен "Тестовый"

