#language: ru

@tree

Функционал: создание 10 номенклатур  

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Создание номенклатуры
*Открытие справочника
	И В командном интерфейсе я выбираю "Справочники" "Номенклатура"
	Тогда открылось окно "Номенклатура"
*Цикл
	И Я запоминаю значение выражения '1' в переменную "Шаг"
	И я делаю 10 раз
		И Я запоминаю значение выражения '"Болт" + $Шаг$' в переменную "Номенклатура"

		И я нажимаю на кнопку с именем 'FormCreate'
		И в поле с именем 'Description_en' я ввожу текст "$Номенклатура$"
		И я нажимаю кнопку выбора у поля с именем 'ItemType'

		И в таблице 'List' я активизирую поле с именем 'Description'
		И в таблице 'List' я выбираю текущую строку

		И я нажимаю кнопку выбора у поля с именем 'Unit'

		И в таблице 'List' я выбираю текущую строку

		И я нажимаю на кнопку с именем 'FormWriteAndClose'
		И я жду закрытия окна "Номенклатура (создание) *" в течение 10 секунд

		И Я запоминаю значение выражения '$Шаг$ + 1' в переменную "Шаг"
		
		
	


