#language: ru

@ExportScenarios
@IgnoreOnCIMainBuild
@tree

Функционал: Заполнение шапки Заказ

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Заполнение шапки документа Заказ

	И из выпадающего списка с именем 'Организация' я выбираю точное значение "ООО \"1000 мелочей\""
	И из выпадающего списка с именем 'Покупатель' я выбираю точное значение "Корнет ЗАО"
	И из выпадающего списка с именем 'Склад' я выбираю точное значение "Склад отдела продаж"

Сценарий: Проверка Количества Итог
	И я запоминаю значение поля "Количество (итог)" как "$ИтоговоеКоличество$"
	Тогда в таблице "Товары" количество строк "равно" "$ИтоговоеКоличество$"
	
	