#language: ru

@tree

Функционал: Проверка авто заполнения поля Организация в документе Заказ Покупателя


Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Создание документа
*Создание документа
	И В командном интерфейсе я выбираю "Продажи" "Заказы покупателей"
	Тогда открылось окно "Заказы покупателей"
	И я нажимаю на кнопку с именем 'FormCreate'

	И я нажимаю кнопку выбора у поля с именем 'Partner'
	Тогда открылось окно "Партнеры"
	И я нажимаю на кнопку с именем 'FormChoose'

*Заполнение если незаполнилось поле Организация
	Если поле с именем 'Company' не заполнено Тогда
		И я нажимаю кнопку выбора у поля с именем 'Company'
		Тогда открылось окно "Организации"
		И я нажимаю на кнопку с именем 'FormChoose'

*Проверка поля на заполнение
	И поле с именем 'Company' заполнено