#language: ru

@tree

Функционал: Проверка доступности Контрагента в ЗАказе покупателей
 

Контекст: ...
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Проверка доступности
*Открытие формы документа
	И В командном интерфейсе я выбираю "Главное" "Заказы покупателей"
	И я нажимаю на кнопку с именем 'FormCreate'

*Заполнение поля Соглашение
	И я нажимаю кнопку выбора у поля с именем 'Agreement'
	Тогда открылось окно "Соглашения"
	И я нажимаю на кнопку с именем 'FormChoose'

*Проверка недоступности поля Контрагент
	И элемент формы "Контрагент" не доступен
* Заполнение Партнера			
	И я нажимаю кнопку выбора у поля с именем 'Partner'
	Тогда открылось окно "Партнеры"
	И я нажимаю на кнопку с именем 'FormChoose'
*Проверка доступности поля Контрагент
	И элемент формы "Контрагент" доступен
		
