#language: ru

@tree

Функционал: Тест с циклами

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Проверка
* цикл
//	И для каждой строки таблицы "ItemList" я выполняю используя колонку "N"
//		И в таблице "ItemList" в поле "Количество" я ввожу текст "10,000"
Сценарий: Удаление строк
//	И пока в таблице "ItemList" количество строк ">" 0 Тогда
//		И в таблице "ItemList" я удаляю строку

Сценарий: Изменение вида цены по условиям

	И для каждой строки таблицы "ItemList" я выполняю
		Если таблица "ItemList" содержит строки Тогда:
			| 'Товар с характеристиками' | 'S/Красный' | 'Цена поставщика 1' |
			И в таблице 'ItemList' я перехожу к строке
			| 'Номенклатура'             | 'Характеристика'          | 'Вид цены'          |
			| 'Товар с характеристиками' | 'S/Красный'               | 'Цена поставщика 1' |

			И в таблице 'ItemList' я нажимаю кнопку выбора у реквизита с именем 'ItemListPriceType'
			Тогда открылось окно "Виды цен"
			И в таблице 'List' я перехожу к строке:
				| "Код" | "Наименование"      | "Ссылка"            |
				| "1"   | "Ручное назначение" | "Ручное назначение" |
			И в таблице 'List' я активизирую поле с именем 'Description'
			И я нажимаю на кнопку с именем 'FormChoose'
				
		
		