#language: ru

@tree
@Отчеты
Функционал: Тестирование отчета Продажи

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Тестирование отчета
*Загрузка документа возврата
	И Создание объектов для теста отчета

*Проведение документа из загрузки
	И В командном интерфейсе я выбираю "Продажи" "Возвраты товаров от покупателей"
	И в таблице 'List' я нажимаю на кнопку с именем 'ListContextMenuPost'

*Открытие отчета
	И В командном интерфейсе я выбираю "Отчеты" "D2001 Продажи"
	Тогда открылось окно "D2001 Продажи"
	И я нажимаю на кнопку с именем 'FormGenerate'

*Проверка отображения возврата
	И в табличном документе "Result" ячейка с адресом "R8C2" равна "-1,000"
		